ViewDirection Property
 The direction towards the viewer.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public XYZ ViewDirection { get; }
  Visual Basic
Public ReadOnly Property ViewDirection As XYZ
	Get
  Visual C++
public:
property XYZ^ ViewDirection {
	XYZ^ get ();
}
 Remarks
 In orthographic views, all objects are projected onto the screen along this direction. In perspective views, the view target point is projected along this direction, but other points are projected towards the eye along different vectors.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →